// --створити масив з:
//     - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
//  let a=[[1,2,3,4,5],['gqdgwdw','vvv','qqqq','www','gttg'],[1,'dwdwd',5<6,43,'ku-ku']];
// console.log(a);

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
//  let a=[];
//     a[0]='peivet';
//     a[1]=23;
//     a[2]=5>6;
// console.log(a);

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// for (let bbc=1;bbc<=10; bbc++){
//     document.write(`<div>item</div>`)
// }
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// for (let bbc=1;bbc<=10; bbc++){
//      document.write(`<div>item ${bbc}</div>`)
//  }
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// let bbc=1;
// while (bbc<21){
//     document.write(`<h1>Privet Okten</h1>`);
//     bbc++;
//
// }
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
// let bbc=1;
// while (bbc<21){
//     document.write(`<h1>Hello ${bbc}</h1>`);
//     bbc++;
// }
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// let a=[1,2,3,4,5,6,7,8,9,10];
// for (let i=0;i<a.length;i++){
//     console.log(a[i]);
// }
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// let a=['efefe','ffefe','1wew','cccc','zxz','asdas','asdaasss','erere','er232','Zzzzz'];
// for (let i=0;i<a.length;i++){
//     console.log(a[i]);
//  }
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// let a=['efefe',211,'1wew',5<6,1232,'asdas',111,true,2222,'Zzzzz'];
// for (let i=0;i<a.length;i++){
//      console.log(a[i]);
//   }
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
// let a=['efefe',211,'1wew',5<6,1232,'asdas',111,true,2222,2>3];
//  for (let i=0;i<a.length;i++){
//      if (typeof a[i]==="boolean"){
//          console.log(a[i]);
//
//
//      }
//
//    }

// let a=['efefe',211,'1wew',5<6,1232,'asdas',111,true,2222,2>3];
//   for (let i=0;i<a.length;i++) {
//       if (typeof a[i] === "number") {
//           console.log(a[i]);
//
//       }
//   }
//
// let a=['efefe',211,'1wew',5<6,1232,'asdas',111,true,2222,2>3];
//   for (let i=0;i<a.length;i++){
//       if (typeof a[i]==="string"){
//           console.log(a[i]);
//
//       }
//
//     }

// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// let a=[];
// a[0]=123;a[1]=true;a[2]=false;a[3]='asdsd';a[4]='123';a[5]=5>6;a[6]=[];a[7]='lolkek';a[8]=122;a[9]=113;
// for (let i = 0; i<a.length;i++){
//     console.log(a[i]);
// }
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// for (let i=1;i<=10;i++){
//     console.log(i);
//     document.write(i)
// }
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// for (let i=1;i<=100;i++){
//     console.log(i);
//      document.write(i);
//  }
// for (let i=1;i<=100;i+=2){
//     console.log(i);
//     document.write(i);
// }
// Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
// for (let i=1;i<=100;i++){
//   if (i%2===0){
//       console.log(i);
//       document.write(i);
//   }
//  }
// for (let i=1;i<=100;i++){
//     if (i%2===1){
//         console.log(i);
//         document.write(i);
//     }
// }