// - Дано натуральное число n. Выведите все числа от 1 до n.
// let n= 7;
// let f=(num)=>{
//     console.log(num);
//     num--;
//     if (num===0){
//         return num;
//     }
//     f(num);
//
// }
// f(n)

// - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.
// let f=(a,b)=>{
//     if (a<=b){
//         console.log(a)
//         if (a!==b){
//             f(a+1,b);
//         }
//
//     }  else {
//         console.log(a);
//         f(a-1,b)
//     }
// }
// f(10,14);

// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]
// let foo = (array, num) => {
//     for (let i = 0; i < array.length; i++) {
//         if (num === i) {
//             let b = array[i]
//             array[i] = array[i + 1]
//             array[i + 1] = b
//
//         }
//     }
//     return array
//
// }
// console.log(foo([9, 8, 0, 4], 1))

// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
//     Двожина масиву від 2 до 100
// EXAMPLE:
//     [1,0,6,0,3] => [1,6,3,0,0]
//     [0,1,2,3,4] => [1,2,3,4,0]
//     [0,0,1,0]   => [1,0,0,0]
// let foo=(array)=>{
//     let gg = array.length;
//     for (let i = 0; i < gg; i++) {
//         if (array[i]===0){
//             array.push(0);
//             array.splice(i,1);
//             gg--;
//             i--;
//         }
//
//     }
//     return array
//
// }
//
// console.log(foo( [1,0,6,0,3]))